Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectPicker.PickObjects Method
 Prompts the user to pick objects from the model with the given prompt.
 Namespace: Tekla.Structures.Analysis.UI
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisObject> PickObjects(
	string analysisModelName,
	AnalysisObjectPicker.PickObjectType type,
	string prompt
)
Public Function PickObjects (
	analysisModelName As String,
	type As AnalysisObjectPicker.PickObjectType,
	prompt As String
) As List(Of AnalysisObject)
Parameters
analysisModelName
Type: System.String
The analysis model name.
type
Type: Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObjectType
The type of objects to pick.
prompt
Type: System.String
The string to display as user guidance.
Return Value
Type: List<AnalysisObject>
An enumerator of analysis object instances.
See Also
Reference
AnalysisObjectPicker Class
Tekla.Structures.Analysis.UI Namespace